["## Dune, first book\n\n![image](https://m.media-amazon.com/images/I/81zN7udGRUL._AC_UF1000,1000_QL80_.jpg)\n\nTime of reading: _July 2024 - August 2024_\n\nThe book dives into big themes like power, religion, and ecology, but it’s also packed with action, complex characters, and world-building. It can be a bit slow at times, but once you’re in, it’s an epic tale that sticks with you. If you’re into deep, thought-provoking sci-fi, Dune is definitely worth checking out.\n\nThe two first books are the best.\n","## Dune, second book\n\n![image](https://m.media-amazon.com/images/I/817Xh+bqwOL._SY342_.jpg)\n\nTime of reading: _August 2024 - August 2024_\n\nCompared to the first book, Dune Messiah is darker and more introspective. It’s less about big battles and desert survival, and more about the cost of power and Paul trying to balance his responsibilities with the things he's lost along the way. Some readers find it slower and more philosophical, but if you’re into the more thoughtful side of the Dune universe, it’s a fascinating follow-up.\n\nAlso, my favourite book in the series.\n","## Don Quixote\n\n![image](https://m.media-amazon.com/images/I/81kIVgGfc+L._SY342_.jpg)\n\nTime of reading: some time in 2021\n\nThe novel is both hilarious and touching, mixing comedy with deeper themes about idealism, reality, and the clash between fantasy and the real world. Don Quixote's delusions get him into all sorts of trouble, but you can’t help but root for him. It’s a long read, but its humor, clever commentary, and memorable characters make it one of the most beloved works of literature.\n\n","## The old man and the sea\n\n## My favourite book\n\n![image](https://m.media-amazon.com/images/I/71wo6d7Ex3L._SY342_.jpg)\n\nTime of reading: 2020, re-read many times\n\nIt’s a simple but intense story about endurance, pride, and the struggle between man and nature. Hemingway’s writing is straightforward and minimalist, but it packs a punch with its deeper themes about dignity, perseverance, and the human spirit. It’s an easy read, but the emotional weight it carries makes it a timeless classic. If you like stories about resilience and quiet strength, The Old Man and the Sea will definitely resonate with you.\n\n"]