[["\u003ccenter\u003e\n\n## Experiência com typescript, e amanhã embarque digital\n### _06/08/2024_\n\n\u003c/center\u003e\n\nAté agora, desenvolver esse site com react e typescript tem sido até que bem fácil. Programação com tipagens mais restritas torna o código bem mais limpo e tranquilo de ser utilizado\n\nO grande problema é aprender a utilizar aproriadamente arquivos externos, é uma vergonha esse post ser \"hard-coded\". Enfim, amanhã vai ser meu primeiro dia no embarque digital, e dia 08, no consevatório. Talvez seja meio punk manter conservatório, UFPE e católica, mas, veremos onde isso leva. \n\nPor agora, quero focar no meu portifólio, adicionar alguns projetos decentes e voltar com disciplina para minha carreira\n\nEntão, tudo que tava escrito aí em cima na verdade foi feito no site antigo! Esse site tá infinitamente melhor, eu posso renderizar tudo em markdown e simplesmente ser feliz. Isso que você tá lendo agora na real é um arquivo em markdown que eu tô puxando da database e renderizando em tempo real.\n\n\u003ccenter\u003e\n\n![image](https://avatars.githubusercontent.com/u/87217922?v=4)\n\nEu posso até renderizar a imagem mais recente do meu github.\n\n\u003c/center\u003e\n\nUm site assim deveria ser o pináculo do jornalismo, só falando.\n","\n Experiência com typescript, e amanhã embarque digital","\n 06/08/2024"],["\u003ccenter\u003e\n\n## Novo website, ótimas atualizações\n### _12 Aug 2024_\n\n\u003c/center\u003e\n\nPara começar bem, vou logo dizendo que passei no conservatório pernambucano de música, para estudar violão erudito. Também, tenho orgulho de dizer que a católica é uma ótima universidade, muito melhor que a estrutura da UFPE (tirando o CiN, claro).\n\nEstou muito feliz, sinto que estou no caminho que nasci para estar, sinto que daqui para frente, vou poder realizar meus sonhos. \n\nUma graduação voltada para pesquisas no CiN, uma graduação voltada para mercado de trabalho (com ótimas oportunidades) na UNICAP, e um conservatório conquistado, agora preciso apenas manter a cabeça no meio de tudo isso.\n\n\u003ccenter\u003e\n\n![image](https://lh3.googleusercontent.com/fife/ALs6j_EKGnWJK8O2dHBacctWV8g7HgO-kiW7BTPSJniAe5g496bjb4OzhtW7akjJ9cgNoFrUqPp8D9399Rp8ldewxg5In5F38gDAyTy1Ge8_4voOH_iTIMI-pA6oooD4Hx2ufm9jTc-016MAhBt6T338oTdK5zC_4Ci9UiRemrCyAZfpcxqAJFijWlOGv3H2mnOnKw8xMr8R8AiUl38QEfVfhLyBy_muWH5Q2D_xwq_X0Kx4SoV632DUoqFmdZV7QtMp2sxA_9hXibJulYV7RlNTeoemlGFMhFitQlOgN5U23MfatGPatIHC2SI33g0Ch_LhBkKwaqxLhahNbM4CQWQegdwdOL1MmQaEaPShWOy8CtvJwWUL8KCbB9-ExlzWT2YETzmeBKt-71i4aJcAZzkXiQxr8Nft_SaLeWshRQFrjixovi4GKwf-Xa-xG3wdbNa0nCJEhlzG8JywXEv1V_Rfxov70auwfYLSmxMf9d3-YVQSw1YHX97r0byyQA8XzGlTq34Qc4jHDLoL-f__ekYU3X7txWAipQS3lMtwRfYfFQ2KMwMRGezvTy0N5fBmAL5Sp1-8f-lvD4wf0cFh25vA2uD2BKw4WTbV4Iizg6wQjvWT_gqC6vmV1SOh73BMEBk6yO_JYmO6uRR6llHKqXr6XMv6uK-6e7VikJOTdEM6F9X-SaSGgm2wburZ6gaPJoI29W9Ecq6ZooT0h9mnErnCmnyI5ZiN3sjbPZRSm5RRx41YCHqwgKjlbyQv09WgRKf8x6QZw32z_uhu2S4PgT3QIqybRbB5gfAb4y70jWE-hNb5exosbMyxOeu3PM9H6TiNKswz_osji_x2f3GOqZEI05WML0OQoLhWklLuYpWGuIuhADe8Q4GQWqksunm5ZxrjmbNA9nK59m-DqG0fDWVVprlHo8-plwTHy-dJY6qlZ3ztRemLRmWgadUyFGi74lgkgxTcL9hBex_-jI-0mVQApoyZCYNPeSFrRsPxRl5CO0xj3KBwQUSyRWRRstv9A_8VNGq1HkO7WKYJ8wp88UIY9CCxvvIY5eJYYdu0MjXm4q_F5zHRm0qVa7y5byvs8-kWjH2AU9NGzEYozWxQmlpy1SBepaAHjW6z0HyTl0owihT94uS5ULLksQCID00oB41ubjIIKZSZumUqNxfi1c8FaSpOUg6A1rFP28HM_JySy5n4T8QONqEUmpxHw55d8-qQLWPQHlPwAJjR4cbwjbOfrVTkR2S_UiwaTXzUo9nh4EVpNjUyQaZ56U6WdK1CNU4TVLzf7Ve5lJoQyU5K5Wei2SCsSRMg11KI0yS7jn2fX7oagLHfQuEFjz7dfiI3-JqJx8hiV9OpCiZ1NOcgAshDJ6ydt7cioXRK2TKZKNKcr8X_61Opl8Cjke2TFHJ6QHMU61sNM3AJb5yMTgw9SHDIYThJsaFCN4_I3P4LRNbAlzBJeqWJTX6iXoxtUfcD66paSef_6ukGLx_B8FKFb6UOACr4wDCQ8G3XOz5uqZpKsvw0nNPgc3UCL8-c5v9_pGVGQ4CTtZG0h8bEzq_bBDy02SGNIqL-KF3aK3hD3l_Kn4ikYipUWWPiZW5PIQNq0pSYfaRRKbqdALI0VVdrFJbxtLTfT2JK_qxfyB2gS2YmdflRNtREXdfdirJ44AKPoTEAkw_5oDd7udUrn_4PoGnOMlqzrpMtcK5FGiOZudYGlIFUNQGo9U8RO-tRCAO_d9o=w910-h891)\n\nFuck it we ball\n\n\u003c/center\u003e\n","\n Novo website, ótimas atualizações","\n 12 Aug 2024"],["\u003ccenter\u003e\n\n## Scripts e backend, planos futuros também\n### _14 Aug 2024_\n\n\u003c/center\u003e\n\nFinalmente tenho um script para escrever nesse blog, fazer um update de tudo na mão \npara cada post iria ser um saco se continuasse do jeito que tava. Agora, esse site \noficialmente tem seu primeiro script de backend.\n\nPor enquanto tudo é em python e typescript, mas eu tenho planos de substituir python para \ngo. Uma linguagem mil vezes superior diga-se de passagem, e com leitura igualmente fácil. \nTambém quero colocar os posts em alguma database, vou procurar alguma gratuita que seja \ndecente.\n\nQuem sabe algum dia eu não escrevo artigos de programação e coloco aqui, em uma área \nseparada.\n\nPorém, com esse site já em um estado funcional, eu posso começar a me dedicar a outros \nprojetos que tenho em mente, são eles:\n\n- Redes neurais em C e python para algumas databases famosas.\n- Algo simples de automação residencial, nem que seja controlar umas leds.\n- Comprar um domínio para esse website (não é bem um projeto, mas essa lista é minha)\n- Adicionar alguma database para esse website, e algumas API's externas.\n\nPor agora é isso, todos os cursos que estou fazendo estão indo muito bem, preciso \nsó adiantar alguns assuntos da UFPE para não ficar muito pesado no futuro.\n\nTudo tá bem ok.\n","\n Scripts e backend, planos futuros também","\n 14 Aug 2024"],["\u003ccenter\u003e\n\n## Iniciando um novo projeto\n### _15 Aug 2024_\n\n\u003c/center\u003e\n\nOntem, por falta de coisas para fazer, decidi criar uma nova linguagem de programação.\n\nEu já havia criado um clone da linguagem \"monkey\" seguindo os passos do livro [Writing an Interpreter in Go](https://interpreterbook.com/), mas, acabei por perder o código tragicamente em um problema de HD.\n\nFiquei frustrado, como um normalmente fica, e nunca mais toquei no livro, agora é a hora de voltar com a beetle programming language, um projeto que eu estou fazendo para poder aumentar meu conhecimento na área de interpreters.\n\nPor enquanto vou fazer a linguagem proposta pelo livro (monkey PL), e depois, farei as alterações que eu achar interessante.\n\nEspero continuar firme e forte nesse projeto, é um que eu almejo fazer já tem bastante tempo. Com esperança, daqui a uns 2 meses deve estar pronto.\n\nLink para o repositório no github: **[pchagas72/beetle](https://github.com/pchagas72/beetle-programming-language)**\n\n\u003ccenter\u003e\n\n![image](https://bernheim.org/wp-content/uploads/2021/09/Hercules-Beetle-300x225.png)\n\nHercules Beetle\n\n\u003c/center\u003e\n\n","\n Iniciando um novo projeto","\n 15 Aug 2024"],["\u003ccenter\u003e\n\n## My experience with music so far\n### _27 Aug 2024_\n\n\u003c/center\u003e\n\nBeing a musician sometimes sucks, your ego will be shattered to pieces as frequently as it can be.\n\nAfter all, as a classical musician, you try to reach perfection, and this is never healthy. But, if you have the mindset that _you will screw up a **lot**_, things will go a bit more smoothly.\n\nI thought that I was a great guitar player, but man, I was wrong. But I'm getting better and better every day. \nThat's the right way to think about getting destroyed by classical teachers.\n","\n My experience with music so far","\n 27 Aug 2024"],["\u003ccenter\u003e\n\n## Certificados na área de TI\n### _01 sep 2024_\n\n\u003c/center\u003e\n\nNo curso de sistemas para internet, do embarque digital, são necessárias 60 horas extras \nde cursos que você faz por si só. Eu acho isso uma ótima ideia! A área de tecnologia quer \nautoditadas.\n\nUm disclaimer rápido: Certificados **NÃO** são tão úteis quanto falam ser, pelo menos na área de ciências da computação.\n\nCertificados podem sim te ajudar a encontrar um emprego, mas o que realmente faz a diferença é sua capacidade de resolver problemas em entrevistas, um bom portifólio e uma boa desenvoltura social! Software você consegue aprender muito mais fácil do que boas regras de convivência e didática.\n\nCertificados são de fato, muito importantes, mas você precisa saber escolher o que vai fazer.\n\nAntes de demonstrar os cursos que eu recomendo, vale demonstrar alguns pensamentos sobre o que fazer:\n\n- Não vale a pena certificados em linguagens de programação. Demonstre que sabe com projetos\n\n- Busque certificados de empresas conhecidas, o valor do certificado é o valor da instituição que te dá ele.\n\n- Certificados em línguas estrangeiras são as melhores opções 90% das vezes, tanto por qualidade, tanto para mostrar que você é capacitado para trabalhar em múltiplas linguagens.\n\nEstou compilando cursos muito bons para iniciar a busca por trabalhos, aqui estão alguns:\n\n- **[Google Data Analytics Professional Certificate](https://www.coursera.org/professional-certificates/google-data-analytics)**\n- **[Google Project Management: Professional Certificate](https://www.coursera.org/professional-certificates/google-project-management)**\n- **[Google IT Support Professional Certificate](https://www.coursera.org/professional-certificates/google-it-support)**\n\nOs certificados do Google são ideais para te ajudar a garantir o primeiro emprego. São objetivos, e bem chamativos.\n","\n Certificados na área de TI","\n 01 sep 2024"]]