{"post1.md": ["<center>\n\n## Experiência com typescript, e amanhã embarque digital\n### _06/08/2024_\n\n</center>\n\nAté agora, desenvolver esse site com react e typescript tem sido até que bem fácil. Programação com tipagens mais restritas torna o código bem mais limpo e tranquilo de ser utilizado\n\nO grande problema é aprender a utilizar aproriadamente arquivos externos, é uma vergonha esse post ser \"hard-coded\". Enfim, amanhã vai ser meu primeiro dia no embarque digital, e dia 08, no consevatório. Talvez seja meio punk manter conservatório, UFPE e católica, mas, veremos onde isso leva. \n\nPor agora, quero focar no meu portifólio, adicionar alguns projetos decentes e voltar com disciplina para minha carreira\n\nEntão, tudo que tava escrito aí em cima na verdade foi feito no site antigo! Esse site tá infinitamente melhor, eu posso renderizar tudo em markdown e simplesmente ser feliz. Isso que você tá lendo agora na real é um arquivo em markdown que eu tô puxando da database e renderizando em tempo real.\n\n<center>\n\n![image](https://avatars.githubusercontent.com/u/87217922?v=4)\n\nEu posso até renderizar a imagem mais recente do meu github.\n\n</center>\n\nUm site assim deveria ser o pináculo do jornalismo, só falando.\n", "Experiência com typescript, e amanhã embarque digital", "06/08/2024"], "post2.md": ["<center>\n\n## Novo website, ótimas atualizações\n### _12 Aug 2024_\n\n</center>\n\nPara começar bem, vou logo dizendo que passei no conservatório pernambucano de música, para estudar violão erudito. Também, tenho orgulho de dizer que a católica é uma ótima universidade, muito melhor que a estrutura da UFPE (tirando o CiN, claro).\n\nEstou muito feliz, sinto que estou no caminho que nasci para estar, sinto que daqui para frente, vou poder realizar meus sonhos. \n\nUma graduação voltada para pesquisas no CiN, uma graduação voltada para mercado de trabalho (com ótimas oportunidades) na UNICAP, e um conservatório conquistado, agora preciso apenas manter a cabeça no meio de tudo isso.\n\n<center>\n\n![image](https://lh3.googleusercontent.com/fife/ALs6j_EKGnWJK8O2dHBacctWV8g7HgO-kiW7BTPSJniAe5g496bjb4OzhtW7akjJ9cgNoFrUqPp8D9399Rp8ldewxg5In5F38gDAyTy1Ge8_4voOH_iTIMI-pA6oooD4Hx2ufm9jTc-016MAhBt6T338oTdK5zC_4Ci9UiRemrCyAZfpcxqAJFijWlOGv3H2mnOnKw8xMr8R8AiUl38QEfVfhLyBy_muWH5Q2D_xwq_X0Kx4SoV632DUoqFmdZV7QtMp2sxA_9hXibJulYV7RlNTeoemlGFMhFitQlOgN5U23MfatGPatIHC2SI33g0Ch_LhBkKwaqxLhahNbM4CQWQegdwdOL1MmQaEaPShWOy8CtvJwWUL8KCbB9-ExlzWT2YETzmeBKt-71i4aJcAZzkXiQxr8Nft_SaLeWshRQFrjixovi4GKwf-Xa-xG3wdbNa0nCJEhlzG8JywXEv1V_Rfxov70auwfYLSmxMf9d3-YVQSw1YHX97r0byyQA8XzGlTq34Qc4jHDLoL-f__ekYU3X7txWAipQS3lMtwRfYfFQ2KMwMRGezvTy0N5fBmAL5Sp1-8f-lvD4wf0cFh25vA2uD2BKw4WTbV4Iizg6wQjvWT_gqC6vmV1SOh73BMEBk6yO_JYmO6uRR6llHKqXr6XMv6uK-6e7VikJOTdEM6F9X-SaSGgm2wburZ6gaPJoI29W9Ecq6ZooT0h9mnErnCmnyI5ZiN3sjbPZRSm5RRx41YCHqwgKjlbyQv09WgRKf8x6QZw32z_uhu2S4PgT3QIqybRbB5gfAb4y70jWE-hNb5exosbMyxOeu3PM9H6TiNKswz_osji_x2f3GOqZEI05WML0OQoLhWklLuYpWGuIuhADe8Q4GQWqksunm5ZxrjmbNA9nK59m-DqG0fDWVVprlHo8-plwTHy-dJY6qlZ3ztRemLRmWgadUyFGi74lgkgxTcL9hBex_-jI-0mVQApoyZCYNPeSFrRsPxRl5CO0xj3KBwQUSyRWRRstv9A_8VNGq1HkO7WKYJ8wp88UIY9CCxvvIY5eJYYdu0MjXm4q_F5zHRm0qVa7y5byvs8-kWjH2AU9NGzEYozWxQmlpy1SBepaAHjW6z0HyTl0owihT94uS5ULLksQCID00oB41ubjIIKZSZumUqNxfi1c8FaSpOUg6A1rFP28HM_JySy5n4T8QONqEUmpxHw55d8-qQLWPQHlPwAJjR4cbwjbOfrVTkR2S_UiwaTXzUo9nh4EVpNjUyQaZ56U6WdK1CNU4TVLzf7Ve5lJoQyU5K5Wei2SCsSRMg11KI0yS7jn2fX7oagLHfQuEFjz7dfiI3-JqJx8hiV9OpCiZ1NOcgAshDJ6ydt7cioXRK2TKZKNKcr8X_61Opl8Cjke2TFHJ6QHMU61sNM3AJb5yMTgw9SHDIYThJsaFCN4_I3P4LRNbAlzBJeqWJTX6iXoxtUfcD66paSef_6ukGLx_B8FKFb6UOACr4wDCQ8G3XOz5uqZpKsvw0nNPgc3UCL8-c5v9_pGVGQ4CTtZG0h8bEzq_bBDy02SGNIqL-KF3aK3hD3l_Kn4ikYipUWWPiZW5PIQNq0pSYfaRRKbqdALI0VVdrFJbxtLTfT2JK_qxfyB2gS2YmdflRNtREXdfdirJ44AKPoTEAkw_5oDd7udUrn_4PoGnOMlqzrpMtcK5FGiOZudYGlIFUNQGo9U8RO-tRCAO_d9o=w910-h891)\n\nFuck it we ball\n\n</center>\n", "Novo website, ótimas atualizações", "12 Aug 2024"], "post3.md": ["<center>\n\n## Scripts e backend, planos futuros também\n### _14 Aug 2024_\n\n</center>\n\nFinalmente tenho um script para escrever nesse blog, fazer um update de tudo na mão \npara cada post iria ser um saco se continuasse do jeito que tava. Agora, esse site \noficialmente tem seu primeiro script de backend.\n\nPor enquanto tudo é em python e typescript, mas eu tenho planos de substituir python para \ngo. Uma linguagem mil vezes superior diga-se de passagem, e com leitura igualmente fácil. \nTambém quero colocar os posts em alguma database, vou procurar alguma gratuita que seja \ndecente.\n\nQuem sabe algum dia eu não escrevo artigos de programação e coloco aqui, em uma área \nseparada.\n\nPorém, com esse site já em um estado funcional, eu posso começar a me dedicar a outros \nprojetos que tenho em mente, são eles:\n\n- Redes neurais em C e python para algumas databases famosas.\n- Algo simples de automação residencial, nem que seja controlar umas leds.\n- Comprar um domínio para esse website (não é bem um projeto, mas essa lista é minha)\n- Adicionar alguma database para esse website, e algumas API's externas.\n\nPor agora é isso, todos os cursos que estou fazendo estão indo muito bem, preciso \nsó adiantar alguns assuntos da UFPE para não ficar muito pesado no futuro.\n\nTudo tá bem ok.\n", "Scripts e backend, planos futuros também", "14 Aug 2024"]}